# BUTTONS

FIND_BUTTON = "Знайти 🙏"
SHARE_BUTTON = "Надати 🙌"

MY_BUTTON = "Мої оголошення 📣"
INFO_BUTTON = "Корисна інформація 📃"

SHARE_HOME_BUTTON = "Житло 🏠"
SHARE_TRIP_BUTTON = "Транспорт 🚗"
SHARE_HELP_BUTTON = "Допомога 🤲"
SHARE_TRIP_REGULAR_BUTTON = "Регулярний 🕓"

FIND_CREATE_BUTTON = "Залишити заявку 🔔"
FIND_HOME_BUTTON = "Житло 🏠"
FIND_TRIP_BUTTON = "Транспорт 🚗"
FIND_HELP_BUTTON = "Допомога 🤲"
FIND_MY_BUTTON = "Мої заявки 🔔"
BLACK_LIST_BUTTON = "Чорний список ❗❗❗️"

BACK_BUTTON = '🔙 Назад'

# VOTE
YES = '✅ Так'
NO = '❌ Нi'

# TEXT

MENU = """
👉 {} Оголошень про допомогу
👉 {} Запитiв про домогу

Бот створений, щоб допомогти знайтися тим, хто хоче надати допомогу та тим, хто її шукає 🙏
"""
# 🙋 {} нових користувачів за останню добу

INFO = """
❗Корисні ресурси:

- [Моніторинг тривог по Україні](https://war.ukrzen.in.ua/alerts/)

- [Агрегована iнформацiя](https://viyna.net/)
- [Агрегована iнформацiя 2](https://docs.google.com/document/d/1ZCxrK4520gSGiGy4Cvqbzzn6TkB02j85XlGc5J5cFrQ/mobilebasic?fbclid=IwAR2H3kUQvBVGuXwi1EimKQu3zfu4s8mO8smhU5PozgKrtG-GC48bjCtgYCc#h.x9logjleyhsb)
- [Карта допомоги](https://mapahelp.me/)
- [Карта допомоги з житлом](https://icanhelp.host/)

Житло 🏠
- [Прихисток](https://prykhystok.in.ua/)
- [Ukraine take shelter](https://www.ukrainetakeshelter.com/)
- [Житло по всьому світу](https://www.host4ukraine.com/)
- [Житло для Українців](https://www.shelter4ua.com/ua#)
- [Форма для заповнення](https://docs.google.com/forms/d/e/1FAIpQLSerQV8PufaIagMPTZ36mlNeVGOzElh_G-sXOAmNvZQUUXS9GQ/viewform)
- @winwin\_realty
- [Безкоштовне проживання в 393 готелях у 42 країнах світу для громадян України](https://lowcost.ua/hospitalitysupport-ua-free/)

- [Житло  на Західній для біженців](https://t.me/+mteSsw5p5K9jOWEy)
- [Молдова](https://www.facebook.com/groups/347615063908402/?ref=share)
- [Польща](https://www.gov.pl/web/udsc/ukraina---ua)
- [Волонтери Польща - машини, житло](https://www.facebook.com/groups/683793819641997/?ref=share)
- [Житло в Німеччині](https://warmes-bett.de/ueber-uns/)
- [Допомога біженцям у Львові](https://helpcenter.in.ua/)


Транспорт/Виїзд 🚗
- [Bla-bla car in war](https://www.ukrainenow.org/refuge)
- [В'їзд до Польщі з України. Актуальна інформація](https://in-poland.com/vezd-v-polshu-iz-ukrainy-aktualnaya-informatsiya/)
- [Список водіїв](https://docs.google.com/spreadsheets/d/13lT4ja1qVoWKMAVaxApLq_wpx7YYHKLdzJbPYhA46GA/htmlview?fbclid=IwAR33tCPlOZh93OlBuvks8nu6nnKH70DNmGzBUar6r5Udx08mjkuI_Eq2H04%23gid%3D0#)
- [Coordination Ukraine Road](https://t.me/+g_QZESG1yuMwZThi)
- [Інформація для тих вимушений поїхати з України](https://helpukriane.notion.site/helpukriane/34c245d9de8f4438b0c7e92bf1267080)
- [Українські волонтери, які евакують людей з Харкова](https://linktr.ee/rescue.now)
- @pomoc2022
- @UkrzalInfo
- @perevezite

Пам'ятайте, ПОЇЗДИ зараз функціонують БЕЗКОШТОВНО! 🚊

Перетин кордону
- [Актуальні дані](https://evacuation-ukraine.notion.site/evacuation-ukraine/ac26344a24bc47729fceafc6642e04cb)
- [Моніторинг черг на кордоні](https://docs.google.com/spreadsheets/d/e/2PACX-1vTmKNAxZn2cPpBqPHnRx9Hc_GPzfi7U92h05hkNuES6pA8l7IcbfdRELMkTBWGcBFoRkUdwlnfX889X/pubhtml?gid=0&single=true&fbclid=IwAR1qTqmfhHYDYFB_N14kCXweiK3BWVGzSfIYlpnD1UhYU33c-Tm0LJQYSuw)
- [Перетин кордону](https://ukraineisforever.notion.site/56e00112898a418a98b1491725aef0d4)
- [Водії на кордоні](https://t.me/+CB4Y-s4O8kM4Yzcy)
- [Кордони України Інфо](https://t.me/ukraineborders_bot)


Благодійність 🕊
- [Повернись живим](https://savelife.in.ua/en/donate/)
- [Національний банк](https://bank.gov.ua/en/news/all/natsionalniy-bank-vidkriv-spetsrahunok-dlya-zboru-koshtiv-na-potrebi-armiyi)
- [Future for Ukraine](https://ffu.foundation/)
- [markobook](https://markobook.com/)
- [ФОНД Діани Макарової](https://www.facebook.com/fondDM)
- [Na Front](https://m.facebook.com/NaFront/)
- [ФРАЙКОР](https://t.me/freikorps_org/3457)
- [hospitallers](https://www.instagram.com/p/CZwQHc5tLSY/?utm_medium=copy_link)
- [Roman Donik](https://t.me/romandonik/2411)
- [Міністерство інформаційної політики України](https://mkip.gov.ua/content/volonterski--organizacii.html?PrintVersion)


Телеграм Чати
- @ukr\_helps
- @moldovaukraina
- @helpzakarpattia

Евакуація
- [Луганська область](https://t.me/luhanskevaquation)
- [Черкаси](https://t.me/EvacuationCherkasy) 
- [Чернівці](https://t.me/evacuationChernovtsy) 
- [Чернiгiв](https://t.me/+i1Np0FJLhs4zMzli) 
- [Київ (Перевезення Київ - Польша)](https://t.me/+68JG-qKNvm9kNjZi)
- [Хмельницький](https://t.me/+qORus3EoBnEzZmNk) 
- [Рівно](https://t.me/+hwq625pYpfUzOWI8) 
- [Полтава](https://t.me/+AGqMw2Sl4ABjMmI0) 
- [Одеса](https://t.me/+Dg2rSrkmuN03NGFk) 
- [Миколаїв](https://t.me/+isy_Cw5MrptmZjlk) 
- [Львів](https://t.me/+UNdwIrUYEBgwOWE8) 
- [Тернопіль](https://t.me/+HK4nfvMpAeM1MWZk) 
- [Кіровоград](https://t.me/+z5TkEVbqiatkOGE0)
- [Біла Церква](https://t.me/+A4vJpMa-iqY3NzJi)
- [Харьків](https://t.me/+vSsvEw-pfNA4NDdi)
- [Кривий Ріг](https://t.me/+SguKJv2dQGRkM2Zk)

Телеграм Канали з Новинами
- @lachentyt
- @insiderUKR
- @Tsaplienko

Ліки
- [Tabletki.ua](https://tabletki.ua/ru/)
- [Список аптек, де за умов війни можна отримати інсулін](https://bit.ly/apteky_insul)
- [АЗС, ліки, укриття, пункти допомоги по Україні](https://opir.org)
- @MedicalForUA_bot

Робота
- @workadojobs
- @jobforukrainians

Бiльше
- @itarmyofukraine2022
- @CyberArm_bot
- [Бот, який допоможе в екстреній ситуації](https://t.me/DovidkaInfo_bot)
- [Безкоштовна правова допомога українцям у всьому світі](https://t.me/artius_law_bot)
- [Пам'ятка біженцям](https://docs.google.com/document/d/1Te15giZrNWc55DUIsT6JCjLvlSkKlz9shHt8_TyhiQY/edit)
- [Центри обігріву на Закарпатті](https://lb.ua/society/2022/02/26/507050_zakarpatti_vimushenih.html)
- [Молдова](https://dopomoga.life/?fbclid=IwAR27iC3_NqX28sSu92XJ2J1NAgGRUXNc14WxoC1-pwk-Wkf1LltV4beiPZw)
- [overhelp.ua](https://www.instagram.com/overhelp.ua/)

Ця сторінка регулярно поповнюватиметься корисною інформацією.
Щодо будь-яких питань та пропозицій пишіть @polianskyi

💪 Якщо бажаєте приєднатися до нашої команди, пишіть @polianskyi

Велике прохання поширити даного бота серед близьких та знайомих!
"""

# MESSAGE
MY = """
Усі ваші оголошення 📰
Редагування поки що НЕМОЖЛИВО.

{}

P.S. Якщо ви хочете змінити оголошення, будь ласка, скопіюйте його на пристрiй, видаліть тут і створіть нове.
"""

SHARE = """
Тут ви можете подати оголошення 📰 про те, що готові надати, щоб ті, хто потребує, могли побачити це та зв'язатися з вами.
Пишіть те саме, що описуєте в інших публічних джерелах (ТГ каналах, інстаграмі тощо) не більше, не менше.

Оберіть, що ви хотіли б надати:
"""

FIND_BEFORE = f"""
Ваші попередні заявки 🔔:

{'{'}{'}'}

"""

FIND = """
`НЕ НАДСИЛАЙТЕ ПЕРЕДОПЛАТУ ❗️`
Пам'ятайте, що навіть платні перевізники не беруть передоплати. Не надсилайте нікому гроші, доки не будете на 100% впевнені, що вам допоможуть. В ідеалі – наполягайте на оплаті після здійснення перевезення!

Оберіть, що ви хотіли б знайти:
"""

FIND_MY = """
Оголошення, на які ви підписалися 📰
Як тільки нове оголошення з'явиться, ми одразу вам повідомимо!
{}

Натисніть кнопку, якщо хочете видалити заявку.
"""

CITY_GENERAL = "Оберіть місто 🏙 (якщо його немає у списку, оберіть обласний центр) ⬇️"

FIND_HOME_CITY = CITY_GENERAL
FIND_HOME_RESULT = """
Житло 🏠
Ось те, що вдалося знайти в `{}`
{}
\n
"""

FIND_TRIP_CITY_FROM = "Виберіть місто, з якого хочете ВИЇХАТИ 🏙 (якщо його немає у списку, виберіть обласний центр) ⬇️"
FIND_TRIP_CITY_TO = "Виберіть місто, в яке хочете ПРИЇХАТИ 🏙 (якщо його немає в списку, виберіть обласний центр) ⬇️"
FIND_TRIP_RESULT = """
Транспорт 🚗
Ось те, що вдалося знайти по маршруту `{}`- `{}`
{}
\n
"""

FIND_NOTHING = "Поки що нічого, але ви можете залишити заявку і ми повідомимо вам, коли таке оголошення з'явиться 🤞"

FIND_CREATE_DONE = "Заявка створена, ми повідомимо вам, коли з'явиться оголошення, яке може бути корисним 🙏"

FOUND = "⭐ З'явилося новое оголошення:\n\n{}"

FIND_HELP_CITY = CITY_GENERAL

FIND_HELP_RESULT = """
Допомога 🤲
Ось те, що вдалося знайти в `{}`
{}
\n
"""

BLACK_LIST_RESULT = """
НЕ СПІВПРАЦЮЙТЕ З ЦИМИ ПЕРСОНАМИ ❗️
Будьте обережні і НІКОЛИ не надсилайте передоплат невідомим людям:

{}

🙏 Ми хочемо застерегти вас від обману. Ці скарги зібрані із різних джерел. Якщо у вас є подібна інформація, будь ласка, напишіть @StillVadim або @polianskyi
"""

SHARE_HOME_CITY = CITY_GENERAL
SHARE_HOME_INFO = """
Житло 🏠

Будь ласка, напишіть будь-яку корисну інформацію про ваше оголошення:
- 📞 Контакти (мобільний, Telegram, WhatsApp, Email)
- Умови (скільки людей/кімнат, на який період)
- Будь-яку іншу інформацію

Ліміт 500 символів.
"""

SHARE_INFO_WARNING = "❗️Ви перевищили ліміт на кількість символів на {} символів."

SHARE_HOME_DONE = """
Створено оголошення про допомогу з проживанням 🏠 у {}.
Дякуємо вам велике 🙏
"""

SHARE_TRIP_CITY_FROM = """
Місце у Транспорті 🚗
Виберіть місто, з якого ви будете виїжджати 🏙 (якщо його немає у списку, виберіть обласний центр) ⬇️
"""
SHARE_TRIP_CITY_TO = """
Місце у Транспорті 🚗
Виберіть місто, в яке ви поїдете 🏙 (якщо його немає у списку, виберіть обласний центр) ⬇️
"""
SHARE_TRIP_SCHEDULING = """
Місце у Транспорті 🚗
🕓 Напишіть дату та час, коли ви плануєте їхати. Або просто час, якщо ви плануєте виїжджати сьогодні.
Приклади:
- 📆 дата + час `2022-03-01 14:30`
- 🕓 тільки час `12:30` (мається на увазі, що ви виїжджаєте сьогодні)
"""
SHARE_TRIP_INFO = """
Місце у Транспорті 🚗
Будь ласка, напишіть будь-яку корисну інформацію про ваше оголошення:
- Контакти 📞 (мобільний, Telegram, WhatsApp, Email)
- Ксловия (скільки місць, чи можна з тваринами)
- Будь-яку іншу інформацію
                    
Ліміт 500 символів.
"""
SHARE_TRIP_DONE = """
Створено оголошення про допомогу з переїздом 🚗 по маршруту `{}`- `{}`.
Дякуємо вам велике 🙏
"""

SHARE_HELP_CITY = CITY_GENERAL

SHARE_HELP_INFO = """
Допомога 🤲

Будь ласка, напишіть будь-яку детальну інформацію про вашу допомогу:
- Предмет допомоги
- 📞 Контакти (мобільний, Telegram, WhatsApp, Email)
- Будь-яку іншу інформацію

Ліміт 500 символів.
"""

SHARE_HELP_DONE = """
Створено оголошення про допомогу з проживанням 🏠 у {}.
Дякуємо вам велике 🙏
"""

DELETE_ANNOUNCEMENT_VOTE = "🗑 Ви впевнені, що хочете видалити це оголошення?"
DELETE_ANNOUNCEMENT_DONE = "✅ Оголошення видалено"
DELETE_ANNOUNCEMENT_CANCELED = "❌ Видалення скасовано"

TRIP_TYPE_NAME = "Транспорт"
HOME_TYPE_NAME = "Житло"
HELP_TYPE_NAME = "Допомога"

ERROR_BASIC = "Упс, щось пішло не так, вибачте. Тиснiть /menu"

DELETE_SIGN = '❌'

HOME_ANNOUNCEMENT = "Житло 🏠 `{}`"
HELP_ANNOUNCEMENT = "Допомога 🤲 `{}`"
SHARE_TRIP_ANNOUNCEMENT = "Транспорт 🚗 `{}` - `{}`\nЧас: {}"
FIND_TRIP_ANNOUNCEMENT = "Транспорт 🚗 `{}` - `{}`"
SHARE_CREATED_INFO = "\n📆 Створено: {}"
SHARE_ANNOUNCEMENT_VERIFIED = "\n✅ Перевірено: {}"
SHARE_ANNOUNCEMENT_INFO = "\n{}"

BLOCKED_USER = "Шахрай 👺 {}"

REGULAR = "Регулярний 🕓"

ADDITIONAL = "Велике прохання поширити даного бота серед близьких та знайомих 🙏"
