# BUTTONS

FIND_BUTTON = "Знайти 🙏"
SHARE_BUTTON = "Надати 🙌"

MY_BUTTON = "Мої оголошення 📣"
INFO_BUTTON = "Корисна інформація 📃"

SHARE_HOME_BUTTON = "Житло 🏠"
SHARE_TRIP_BUTTON = "Транспорт 🚗"
SHARE_TRIP_REGULAR_BUTTON = "Регулярний 🕓"

FIND_CREATE_BUTTON = "Залишити заявку 🔔"
FIND_HOME_BUTTON = "Житло 🏠"
FIND_TRIP_BUTTON = "Транспорт 🚗"
FIND_MY_BUTTON = "Мої заявки 🔔"

BACK_BUTTON = '🔙 Назад'

# VOTE
YES = '✅ Так'
NO = '❌ Нi'

# TEXT

MENU = """
Бот створений, щоб допомогти знайтися тим, хто хоче надати допомогу та тим, хто її шукає 🙏
"""

INFO = """
❗Корисні ресурси:

- [Агрегована iнвофмацiя](https://docs.google.com/document/d/1ZCxrK4520gSGiGy4Cvqbzzn6TkB02j85XlGc5J5cFrQ/mobilebasic?fbclid=IwAR2H3kUQvBVGuXwi1EimKQu3zfu4s8mO8smhU5PozgKrtG-GC48bjCtgYCc#h.x9logjleyhsb)

Житло 🏠
- [Прихисток](https://prykhystok.in.ua/)
- [Молдова](https://www.facebook.com/groups/347615063908402/?ref=share)
- [Польща](https://www.gov.pl/web/udsc/ukraina---ua)
- [Житло  на Західній для біженців](https://t.me/+mteSsw5p5K9jOWEy)
- [Центри обігріву на Закарпатті](https://lb.ua/society/2022/02/26/507050_zakarpatti_vimushenih.html)
- [Волонтери Польща - машини, житло](https://www.facebook.com/groups/683793819641997/?ref=share)
- [Форма для заповнення](https://docs.google.com/forms/d/e/1FAIpQLSerQV8PufaIagMPTZ36mlNeVGOzElh_G-sXOAmNvZQUUXS9GQ/viewform)
- @winwin\_realty
- @help\_find\_house


Транспорт/Виїзд 🚗
- [Bla-bla car in war](https://www.ukrainenow.org/refuge)
- [В'їзд до Польщі з України. Актуальна інформація](https://in-poland.com/vezd-v-polshu-iz-ukrainy-aktualnaya-informatsiya/)
- [Список водіїв](https://docs.google.com/spreadsheets/d/13lT4ja1qVoWKMAVaxApLq_wpx7YYHKLdzJbPYhA46GA/htmlview?fbclid=IwAR33tCPlOZh93OlBuvks8nu6nnKH70DNmGzBUar6r5Udx08mjkuI_Eq2H04%23gid%3D0#)
- [Coordination Ukraine Road](https://t.me/+g_QZESG1yuMwZThi)
- [Drivers UA border](https://t.me/+CB4Y-s4O8kM4Yzcy)
- @pomoc2022
- @UkrzalInfo
- @perevezite


Пам'ятайте, ПОЇЗДИ зараз функціонують БЕЗКОШТОВНО! 🚊

Благодійність 🕊
- [Повернись живим](https://savelife.in.ua/en/donate/)
- [Національний банк](https://bank.gov.ua/en/news/all/natsionalniy-bank-vidkriv-spetsrahunok-dlya-zboru-koshtiv-na-potrebi-armiyi)

Телеграм Чати
- @ukr\_helps
- @moldovaukraina
- @helpzakarpattia

Телеграм Канали з Новинами
- @korotkoiyasn
- @insiderUKR
- @Tsaplienko

Бiльше
- @itarmyofukraine2022
- [Карта, де люди та організації можуть допомогти якоюсь послугою біженцям з України](https://mapahelp.me/)
- [Бот, який допоможе в екстреній ситуації](https://t.me/DovidkaInfo_bot)
- [Пам'ятка біженцям](https://docs.google.com/document/d/1Te15giZrNWc55DUIsT6JCjLvlSkKlz9shHt8_TyhiQY/edit)
- [Молдова](https://dopomoga.life/?fbclid=IwAR27iC3_NqX28sSu92XJ2J1NAgGRUXNc14WxoC1-pwk-Wkf1LltV4beiPZw)

Ця сторінка регулярно поповнюватиметься корисною інформацією.
Щодо будь-яких питань та пропозицій пишіть @polianskyi
"""

# MESSAGE
MY = """
Усі ваші оголошення 📰
Редагування поки що НЕМОЖЛИВО.

{}

P.S. Якщо ви хочете змінити оголошення, будь ласка, скопіюйте його на девайс, видаліть тут і створіть нове.
"""

SHARE = """
Тут ви можете подати оголошення 📰 про те, що готові надати, щоб ті, хто потребує, могли побачити це та зв'язатися з вами.
Пишіть те саме, що описуєте в інших публічних джерелах (ТГ каналах, інстаграмі тощо) не більше, не менше.

Оберіть, що ви хотіли б надати:
"""

FIND_BEFORE = f"""
Ваші попередні заявки 🔔:

{'{'}{'}'}

"""

FIND = "Оберіть, що ви хотіли б знайти:"

FIND_MY = """
Оголошення, на які ви передплатили 📰
Як тільки нове оголошення з'явиться, ми одразу вам повідомимо!
{}

Натисніть кнопку, якщо хочете видалити заявку.
"""

CITY_GENERAL = "Оберіть місто 🏙 (якщо його немає у списку, оберіть обласний центр) ⬇️"

FIND_HOME_CITY = CITY_GENERAL
FIND_HOME_RESULT = """
Житло 🏠
Ось те, що вдалося знайти в `{}`
{}
"""

FIND_TRIP_CITY_FROM = "Виберіть місто, з якого хочете ВИЇХАТИ 🏙 (якщо його немає у списку, виберіть обласний центр) ⬇️"
FIND_TRIP_CITY_TO = "Виберіть місто, в яке хочете ПРИЇХАТИ 🏙 (якщо його немає в списку, виберіть обласний центр) ⬇️"
FIND_TRIP_RESULT = """
Транспорт 🚗
Ось те, що вдалося знайти по маршруту `{}`- `{}`
{}
"""

FIND_NOTHING = "Поки що нічого, але ви можете залишити заявку і ми повідомимо вам, коли таке оголошення з'явиться 🤞"

FIND_CREATE_DONE = "Заявка створена, ми повідомимо вам, коли з'явиться оголошення, яке може бути корисним 🙏"

FOUND = "⭐ З'явилося новое оголошення:\n\n{}"

SHARE_HOME_CITY = CITY_GENERAL
SHARE_HOME_INFO = """
Житло 🏠

Будь ласка, напишіть будь-яку корисну інформацію про ваше оголошення:
- 📞 Контакти (мобільний, Telegram, WhatsApp, Email)
- Умови (скільки людей/кімнат, на який період)
- Будь-яку іншу інформацію

Ліміт 500 символів, вибачте.
"""

SHARE_INFO_WARNING = "❗️Ви перевищили ліміт на кількість символів на {} символів."

SHARE_HOME_DONE = """
Створено оголошення про допомогу з проживанням 🏠 у {}.
Дякуємо вам велике 🙏
"""

SHARE_TRIP_CITY_FROM = """
Місце у Транспорті 🚗
Виберіть місто, з якого ви будете виїжджати 🏙 (якщо його немає у списку, виберіть обласний центр) ⬇️
"""
SHARE_TRIP_CITY_TO = """
Місце у Транспорті 🚗
Виберіть місто, в яке ви поїдете 🏙 (якщо його немає у списку, виберіть обласний центр) ⬇️
"""
SHARE_TRIP_SCHEDULING = """
Місце у Транспорті 🚗
🕓 Напишіть дату та час, коли ви плануєте їхати. Або просто час, якщо ви плануєте виїжджати сьогодні.
Приклади:
- 📆 дата + час `2022-03-01 14:30`
- 🕓 тільки час `12:30` (мається на увазі, що ви виїжджаєте сьогодні)
"""
SHARE_TRIP_INFO = """
Місце у Транспорті 🚗
Будь ласка, напишіть будь-яку корисну інформацію про ваше оголошення:
- Контакти 📞 (мобільний, Telegram, WhatsApp, Email)
- Ксловия (скільки місць, чи можна з тваринами)
- Будь-яку іншу інформацію
                    
Ліміт 500 символів, вибачте.
"""
SHARE_TRIP_DONE = """
Створено оголошення про допомогу з переїздом 🚗 по маршруту `{}`- `{}`.
Дякуємо вам велике 🙏
"""

DELETE_ANNOUNCEMENT_VOTE = "🗑 Ви впевнені, що хочете видалити це оголошення?"
DELETE_ANNOUNCEMENT_DONE = "✅ Оголошення видалено"
DELETE_ANNOUNCEMENT_CANCELED = "❌ Видалення скасовано"

TRIP_TYPE_NAME = "Транспорт"
HOME_TYPE_NAME = "Житло"

ERROR_BASIC = "Упс, щось пішло не так, вибачте."

ANY_CITY_CHOICE = ["Неважливо"]
DELETE_SIGN = '❌'

REGULAR = "Регулярний 🕓"
